var movies =`[{"movieName": "Parasite",
    "image": "img/parasite.jpg",
    "description": "The Kims - mother and father Chung-sook and Ki-taek, and their young adult offspring, son Ki-woo and daughter Ki-jung - are a poor family living in a shabby and cramped half basement apartment in a busy lower working class commercial district of Seoul. Without even knowing it, they, especially Mr. and Mrs. Kim, literally smell of poverty.",
    "director": "Bong Joon-ho",
    "imdb":"8.6",
    "year": "2019",
    "likes": 0
},
{"movieName": "Shutter Island",
    "image": "img/island.jpg",
    "description": "In 1954, up-and-coming U.S. marshal Teddy Daniels is assigned to investigate the disappearance of a patient from Boston's Shutter Island Ashecliffe Hospital. He's been pushing for an assignment on the island for personal reasons, but before long he thinks he's been brought there as part of a twisted plot by hospital doctors whose radical treatments range from unethical to illegal to downright sinister. ",
    "director": "Martin Scorsese",
    "imdb":"8.2",
    "year": "2010",
    "likes": 0
},
{"movieName": "Once Upon a Time in the West",
    "image": "img/once.jpg",
    "description": "The film portrays two conflicts that take place around Flagstone, a fictional town in the American Old West: a land battle related to the construction of a railroad, and a mission of vengeance against a cold-blooded killer. ",
    "director": "Sergio Leone",
    "imdb":"8.5",
    "year": "1968",
    "likes": 0
},
{"movieName": "Reservoir Dogs",
    "image": "img/dogs.jpg",
    "description": "Eight men eat breakfast at a Los Angeles diner before carrying out a diamond heist. Led by Joe Cabot and his son and underboss 'Nice Guy' Eddie Cabot, all other criminals use aliases: Mr. Brown, Mr. White, Mr. Blonde, Mr. Blue, Mr. Orange, and Mr. Pink. After discussing the Madonna song 'Like a Virgin' and arguing over Pink's habit of not tipping, the group leaves the diner to perform the heist.",
    "director": "Quentin Tarantino",
    "imdb":"8.3",
    "year": "1992",
    "likes": 0
},
{"movieName": "Prisoners",
    "image": "img/prisoners.jpg",
    "description": "The plot focuses on the abduction of two young girls in Pennsylvania and the subsequent search for the suspected abductor by the police. After police arrest a young suspect and release him, the father of one of the daughters takes matters into his own hands.",
    "director": "Denis Villeneuve",
    "imdb":"8.1",
    "year": "2013",
    "likes": 0
},
{
    "movieName": "The Prestige",
    "image": "img/prestige.jpg",
    "description": "In 1890s London, Robert Angier and Alfred Borden work as shills for a magician, under the mentorship of John Cutter, an engineer who designs stage magic (a job termed ingenieur in the film).",
    "director": "Christopher Nolan",
    "imdb":"8.5",
    "year": "2006",
    "likes": 0
},
{"movieName": "Split",
    "image": "img/split.jpg",
    "description": "Casey Cooke is a withdrawn teenager. After being invited to a birthday party at the King of Prussia Mall, she accepts a ride home from her classmate Claire's father, who also takes Claire's friend Marcia.",
    "director": "M. Night Shyamalan",
    "imdb":"7.3",
    "year": "2016",
    "likes": 0
},
{"movieName": "Mad Max: Fury Road",
    "image": "img/mad_max.jpg",
    "description": "The world has become a desert wasteland and civilisation has collapsed as a result of wars and dwindling resources. Max Rockatansky, a survivor haunted by visions of deceased people, is captured by the War Boys, the army of the tyrannical Immortan Joe, and taken to Joe's Citadel. ",
    "director": "George Miller",
    "imdb":"8.1",
    "year": "2015",
    "likes": 0
},
{"movieName": "Inception",
    "image": "img/inception.jpg",
    "description": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. ",
    "director": "Christopher Nolan",
    "imdb":"8.8",
    "year": "2010",
    "likes": 0
},
{"movieName": "The Hobbit: An Unexpected Journey",
    "image": "img/hobbit.jpg",
    "description": "Approaching his 111th birthday, the Hobbit Bilbo Baggins begins writing down the full story of his adventure 60 years earlier for the benefit of his nephew Frodo. Long before Bilbo's involvement, the Dwarf king Thrór brought an era of prosperity for his kin under the Lonely Mountain until the arrival of the dragon Smaug. Destroying the nearby town of Dale, Smaug drove the Dwarves out of their mountain and took their hoard of gold. Thrór's grandson, Thorin, sees King Thranduil and his Wood-elves on a nearby hillside, and is dismayed when they leave rather than aid his people, resulting in Thorin's everlasting hatred of Elves.",
    "director": "Peter Jackson",
    "imdb":"8.6",
    "year": "2012",
    "likes": 0
},
{"movieName": "Forest Gump",
    "image": "img/forest.jpg",
    "description": "In 1981 at a bus stop in Savannah, Georgia, a man named Forrest Gump recounts his life story to strangers who sit next to him on a bench.",
    "director": "Robert Zemeckis",
    "imdb":"8.8",
    "year": "1994",
    "likes": 0
},
{"movieName": "American Beauty",
    "image": "img/american_beauty.jpg",
    "description": "Lester Burnham is a middle-aged magazine executive who despises his job and is unhappily married to Carolyn, a neurotic and ambitious real estate broker. Their 16-year-old daughter, Jane, abhors her parents and has low self-esteem. ",
    "director": "Sam Mendes",
    "imdb":"8.3",
    "year": "1999",
    "likes": 0
},
{"movieName": "Seven",
    "image": "img/seven.jpg",
    "description": "Soon-to-retire detective William Somerset is partnered with short-tempered but idealistic David Mills, who has recently moved to an unnamed large city with his wife Tracy.",
    "director": " David Fincher",
    "imdb":"8.6",
    "year": "1995",
    "likes": 0
},
{"movieName": "Fight Club",
    "image": "img/fight_club.jpg",
    "description": "The unnamed Narrator is an automobile recall specialist who is unfulfilled by his job and possessions and suffers from severe insomnia.",
    "director": "David Fincher",
    "imdb":"8.8",
    "year": "1999",
    "likes": 0
},
{"movieName": "Matrix",
    "image": "img/matrix.jpg",
    "description": "At an abandoned hotel within a major city, a woman (later revealed to be Trinity) is cornered by a police squad but overpowers them with superhuman abilities.",
    "director": "the Wachowskis",
    "imdb":"8.7",
    "year": "1999",
    "likes": 0
},
{"movieName": "Silence of the Lambs",
    "image": "img/silence.jpg",
    "description": "Clarice Starling is pulled from her FBI training at the Quantico, Virginia FBI Academy by Jack Crawford of the Bureau's Behavioral Science Unit. He assigns her to interview Hannibal Lecter, a former psychiatrist and incarcerated cannibalistic serial killer.",
    "director": " Jonathan Demme",
    "imdb":"8.6",
    "year": "1991",
    "likes": 0
},
{"movieName": "Pulp Fiction",
    "image": "img/pulp_fiction.jpg",
    "description": "At an abandoned hotel within a major city, a woman (later revealed to be Trinity) is cornered by a police squad but overpowers them with superhuman abilities.",
    "director": "Quentin Tarantino",
    "imdb":"8.9",
    "year": "1994",
    "likes": 0
},
{"movieName": "Trainspotting",
    "image": "img/matrix.jpg",
    "description": "26-year-old Mark Renton is an unemployed heroin addict living with his parents in the suburbs of Edinburgh, Scotland. He regularly partakes in drug use with his friends: Simon 'Sick Boy' Williamson, a treacherous, womanising James Bond fanatic; Daniel 'Spud' Murphy, an outwardly docile confidence trickster; and Swanney, 'Mother Superior', their dealer.",
    "director": "Danny Boyle",
    "imdb":"8.1",
    "year": "1996",
    "likes": 0
}]`